app/Validation/Userrules.php

    public function validateUser(string $str, string $fields, array $data)
    {
        $model = new AkunModel();
        $user = $model->where('username', $data['username'])
            ->first();
---
SELECT *
FROM `akun`
WHERE `username` = 'admin123'
 LIMIT 1