app/Controllers/Auth.php

            } else {
                $model = new AkunModel();

                $user = $model->where('username', $this->request->getVar('username'))
                ->first();
---
SELECT *
FROM `akun`
WHERE `username` = 'admin123'
 LIMIT 1