app/Controllers/Product.php

SELECT *
FROM `produk`
---
    public function index()
    {
        $data = [
            'title' => 'Produk',
            'menu' => 'Product',
            'isi' => 'product',
            'db' => new ProductModel(),
            'keyword' => $this->request->getVar('keyword'),
        ];

        if($data['keyword']) {
            $data['produk'] = $data['db']->search($data['keyword']);
            if ($data['produk'] == null) {
                session()->setFlashdata('pesan', 'Produk yang anda cari tidak ada');
            }
        }
        else {
            $data['produk'] = $data['db']->findAll();