app/Models/ProductModel.php

SELECT *
FROM `produk`
WHERE `nama_produk` = 'Cutting Stiker'
---
    public function getDetail($id)
    {
        return $this
         ->select('*')
         ->where('nama_produk', $id)
         ->get()->getRowArray();